---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.OverlappingLines
source: html/81d30263-8278-d43f-3b1c-d75e4d226648.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.OverlappingLines Property

GridChain sketch contains lines which overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId OverlappingLines { get; }
```